freq0ut/PIC24-Projects/LCDTest/config.h
/* 
 * File:   config.h
 * Author: Zachary
 *
 * Created on September 9, 2015, 4:00 PM
 */


// PIC24FJ64GA002 Configuration Bit Settings

// 'C' source line config statements

#include <xc.h>

//// CONFIG2
//#pragma config POSCMOD = HS             // Primary Oscillator Select (HS Oscillator mode selected)
//#pragma config I2C1SEL = PRI            // I2C1 Pin Location Select (Use default SCL1/SDA1 pins)
//#pragma config IOL1WAY = OFF            // IOLOCK Protection (IOLOCK may be changed via unlocking seq)
//#pragma config OSCIOFNC = ON           // Primary Oscillator Output Function (OSC2/CLKO/RC15 functions as CLKO (FOSC/2))
//#pragma config FCKSM = CSDCMD           // Clock Switching and Monitor (Clock switching and Fail-Safe Clock Monitor are disabled)
//#pragma config FNOSC = FRCPLL              // Oscillator Select (Fast RC Oscillator (FRC))
//#pragma config SOSCSEL = SOSC           // Sec Oscillator Select (Default Secondary Oscillator (SOSC))
//#pragma config WUTSEL = LEG             // Wake-up timer Select (Legacy Wake-up Timer)
//#pragma config IESO = OFF               // Internal External Switch Over Mode (IESO mode (Two-Speed Start-up) disabled)
//
//// CONFIG1
//#pragma config WDTPS = PS32768          // Watchdog Timer Postscaler (1:32,768)
//#pragma config FWPSA = PR128            // WDT Prescaler (Prescaler ratio of 1:128)
//#pragma config WINDIS = OFF             // Watchdog Timer Window (Windowed Watchdog Timer enabled; FWDTEN must be 1)
//#pragma config FWDTEN = OFF             // Watchdog Timer Enable (Watchdog Timer is disabled)
//#pragma config ICS = PGx1               // Comm Channel Select (Emulator EMUC1/EMUD1 pins are shared with PGC1/PGD1)
//#pragma config GWRP = OFF               // General Code Segment Write Protect (Writes to program memory are allowed)
//#pragma config GCP = OFF                // General Code Segment Code Protect (Code protection is disabled)
//#pragma config JTAGEN = OFF             // JTAG Port Enable (JTAG port is disabled)

//// CONFIG2
#pragma config POSCMOD = XT             // Primary Oscillator Select (HS Oscillator mode selected)
#pragma config I2C1SEL = PRI            // I2C1 Pin Location Select (Use default SCL1/SDA1 pins)
#pragma config IOL1WAY = OFF            // IOLOCK Protection (IOLOCK may be changed via unlocking seq)
#pragma config OSCIOFNC = OFF           // Primary Oscillator Output Function (OSC2/CLKO/RC15 functions as CLKO (FOSC/2))
#pragma config FCKSM = CSDCMD           // Clock Switching and Monitor (Clock switching and Fail-Safe Clock Monitor are disabled)
#pragma config FNOSC = PRI              // Oscillator Select (Primary Oscillator (XT, HS, EC))
#pragma config SOSCSEL = SOSC           // Sec Oscillator Select (Default Secondary Oscillator (SOSC))
#pragma config WUTSEL = LEG             // Wake-up timer Select (Legacy Wake-up Timer)
#pragma config IESO = OFF                // Internal External Switch Over Mode (IESO mode (Two-Speed Start-up) enabled)

// CONFIG1
#pragma config WDTPS = PS32768          // Watchdog Timer Postscaler (1:32,768)
#pragma config FWPSA = PR128            // WDT Prescaler (Prescaler ratio of 1:128)
#pragma config WINDIS = OFF             // Watchdog Timer Window (Windowed Watchdog Timer enabled; FWDTEN must be 1)
#pragma config FWDTEN = OFF             // Watchdog Timer Enable (Watchdog Timer is disabled)
#pragma config ICS = PGx1               // Comm Channel Select (Emulator EMUC1/EMUD1 pins are shared with PGC1/PGD1)
#pragma config GWRP = OFF               // General Code Segment Write Protect (Writes to program memory are allowed)
#pragma config GCP = OFF                // General Code Segment Code Protect (Code protection is disabled)
#pragma config JTAGEN = OFF             // JTAG Port Enable (JTAG port is disabled)

#ifndef __DELAY_H

	#define FOSC		32000000LL		// clock-frequecy in Hz with suffix LL (64-bit-long), eg. 32000000LL for 32MHz
	#define FCY      	(FOSC/2)		// MCU is running at FCY MIPS

	#define delay_us(x)	__delay32(((x*FCY)/1000000L))	// delays x us
	#define delay_ms(x)	__delay32(((x*FCY)/1000L))		// delays x ms

	#define __DELAY_H	1

#endif

/*****************************************************************************
 * DEFINITIONS
 *****************************************************************************/
// External oscillator frequency
#define SYSCLK          32000000
/*****************************************************************************/
// Baudrate

#define BAUDRATE1		9600

/*****************************************************************************
 * U2BRG register value and baudrate mistake calculation
 *****************************************************************************/
#define BAUDRATEREG1 SYSCLK/32/BAUDRATE1-1

#if BAUDRATEREG1 > 255
#error Cannot set up UART1 for the SYSCLK and BAUDRATE.Correct values in main.h and uart2.h files.
#endif

#define BAUDRATE_MISTAKE 1000*(BAUDRATE1-SYSCLK/32/(BAUDRATEREG1+1))/BAUDRATE1
#if (BAUDRATE_MISTAKE > 2)||(BAUDRATE_MISTAKE < -2)
#error UART1 baudrate mistake is too big  for the SYSCLK and BAUDRATE1. Correct values in uart2.c file.
#endif 